Tekla.Structures.Drawing.LinkAttributes
The LinkAttributes class contains the attributes for controlling the appearance of a link.
The following code shows how to load user-defined attributes that are named "red":
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
LinkAttributes linkAttributes = new LinkAttributes("red");
}
}

Tekla.Structures.Drawing.LinkAttributes.IsUnderlined
Defines whether the link is underlined or not.

Tekla.Structures.Drawing.LinkAttributes.Font
Gets or sets the font attributes.

Tekla.Structures.Drawing.LinkAttributes.Scaling
Gets or sets the link scaling options.

Tekla.Structures.Drawing.LinkAttributes.Frame
Gets or sets the link frame attributes.

Tekla.Structures.Drawing.LinkAttributes.#ctor(System.Boolean)
Initializes a new instance of link attributes attributes class that may load standard attributes.

Tekla.Structures.Drawing.LinkAttributes.#ctor
Creates a new link attributes instance using standard attributes.

Tekla.Structures.Drawing.LinkAttributes.#ctor(System.String)
Creates a new link attributes instance loading the specified attributes.
AttributeFile: The name of the attribute file.

Tekla.Structures.Drawing.LinkAttributes.LoadAttributes(System.String)
Loads the link frame attributes from the specified file.
AttributeFile: The name of the attribute file.
Returns: True if succeeded.

Tekla.Structures.Drawing.LinkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.